{
    "link": "/stream/changelog/",
    "entries": [
        {
            "publish_date": "2023-08-08",
            "title": "Scheduled Deletion",
            "description": "Stream now supports adding a scheduled deletion date to new and existing videos. Live inputs support deletion policies for automatic recording deletion.\n\nFor more, refer to the [video on demand](/stream/uploading-videos/) or [live input](/stream/stream-live/) docs."
        },
        {
            "publish_date": "2023-05-16",
            "title": "Multiple audio tracks now generally available",
            "description": "Stream supports adding multiple audio tracks to an existing video.\n\nFor more, refer to the [documentation](https://developers.cloudflare.com/stream/edit-videos/adding-additional-audio-tracks/) to get started."
        },
        {
            "publish_date": "2023-04-26",
            "title": "Player Enhancement Properties",
            "description": "Cloudflare Stream now supports player enhancement properties.\n\nWith player enhancements, you can modify your video player to incorporate elements of your branding, such as your logo, and customize additional options to present to your viewers.\n\nFor more, refer to the [documentation](https://developers.cloudflare.com/stream/edit-videos/player-enhancements/) to get started."
        },
        {
            "publish_date": "2023-03-21",
            "title": "Limits for downloadable MP4s for live recordings",
            "description": "Previously, generating a download for a live recording exceeding four hours resulted in failure.\n\nTo fix the issue, now video downloads are only available for live recordings under four hours. Live recordings exceeding four hours can still be played but cannot be downloaded."
        },
        {
            "publish_date": "2023-01-04",
            "title": "Earlier detection (and rejection) of non-video uploads",
            "description": "Cloudflare Stream now detects non-video content on upload using [the POST API](/stream/uploading-videos/upload-video-file/) and returns a 400 Bad Request HTTP error with code `10059`.\n\nPreviously, if you or one of your users attempted to upload a file that is not a video (ex: an image), the request to upload would appear successful, but then fail to be encoded later on.\n\nWith this change, Stream responds to the upload request with an error, allowing you to give users immediate feedback if they attempt to upload non-video content."
        },
        {
            "publish_date": "2022-12-08",
            "title": "Faster mp4 downloads of live recordings",
            "description": "Generating MP4 downloads of live stream recordings is now significantly faster. For more, refer to [the docs](/stream/stream-live/download-stream-live-videos/)."
        },
        {
            "publish_date": "2022-11-29",
            "title": "Multiple audio tracks (closed beta)",
            "description": "Stream now supports adding multiple audio tracks to an existing video upload. This allows you to:\n\n- Provide viewers with audio tracks in multiple languages\n- Provide dubbed audio tracks, or audio commentary tracks (ex: Director’s Commentary)\n- Allow your users to customize the customize the audio mix, by providing separate audio tracks for music, speech or other audio tracks.\n- Provide Audio Description tracks to ensure your content is accessible. ([WCAG 2.0 Guideline 1.2 1](https://www.w3.org/TR/WCAG20/#media-equiv-audio-desc-only))\n\nTo request an invite to the beta, refer to [this post](https://community.cloudflare.com/t/new-in-beta-support-for-multiple-audio-tracks/439629)."
        },
        {
            "publish_date": "2022-11-22",
            "title": "VP9 support for WebRTC live streams (beta)",
            "description": "Cloudflare Stream now supports [VP9](https://developers.google.com/media/vp9) when streaming using [WebRTC (WHIP)](/stream/webrtc-beta/), currently in beta."
        },
        {
            "publish_date": "2022-11-08",
            "title": "Reduced time to start WebRTC streaming and playback with Trickle ICE",
            "description": "Cloudflare Stream's [WHIP](https://datatracker.ietf.org/doc/draft-ietf-wish-whip/) and [WHEP](https://www.ietf.org/archive/id/draft-murillo-whep-01.html) implementations now support [Trickle ICE](https://datatracker.ietf.org/doc/rfc8838/), reducing the time it takes to initialize WebRTC connections, and increasing compatibility with WHIP and WHEP clients.\n\nFor more, refer to [the docs](/stream/webrtc-beta/)."
        }, 
        {
            "publish_date": "2022-11-07",
            "title": "Deprecating the 'per-video' Analytics API",
            "description": "The “per-video” analytics API is being deprecated. If you still use this API, you will need to switch to using the [GraphQL Analytics API](/stream/getting-analytics/fetching-bulk-analytics/) by February 1, 2023. After this date, the per-video analytics API will be no longer available.\n\nThe GraphQL Analytics API provides the same functionality and more, with additional filters and metrics, as well as the ability to fetch data about multiple videos in a single request. Queries are faster, more reliable, and built on a shared analytics system that you can [use across many Cloudflare products](/analytics/graphql-api/features/data-sets/).\n\nFor more about this change and how to migrate existing API queries, refer to [this post](https://community.cloudflare.com/t/migrate-to-the-stream-graphql-analytics-api-by-feb-1st-2023/433252) and the [GraphQL Analytics API docs](/stream/getting-analytics/fetching-bulk-analytics/)."
        },
        {
            "publish_date": "2022-11-01",
            "title": "Create an unlimited number of live inputs",
            "description": "Cloudflare Stream now has no limit on the number of [live inputs](/api/operations/stream-live-inputs-retrieve-a-live-input) you can create. Stream is designed to allow your end-users to go live — live inputs can be created quickly on-demand via a single API request for each of user of your platform or app.\n\nFor more on creating and managing live inputs, get started with the [docs](/stream/stream-live/)."
        }, 
        {
            "publish_date": "2022-10-20",
            "title": "More accurate bandwidth estimates for live video playback",
            "description": "When playing live video, Cloudflare Stream now provides significantly more accurate estimates of the bandwidth needs of each quality level to client video players. This ensures that live video plays at the highest quality that viewers have adequate bandwidth to play.\n\nAs live video is streamed to Cloudflare, we transcode it to make it available to viewers at mulitple quality levels. During transcoding, we learn about the real bandwidth needs of each segment of video at each quality level, and use this to provide an estimate of the bandwidth requirements of each quality level the in HLS (`.m3u8`) and DASH (`.mpd`) manifests.\n\nIf a live stream contains content with low visual complexity, like a slideshow presentation, the bandwidth estimates provided in the HLS manifest will be lower, ensuring that the most viewers possible view the highest quality level, since it requires relatively little bandwidth. Conversely, if a live stream contains content with high visual complexity, like live sports with motion and camera panning, the bandwidth estimates provided in the HLS manifest will be higher, ensuring that viewers with inadequate bandwidth switch down to a lower quality level, and their playback does not buffer.\n\nThis change is particularly helpful if you're building a platform or application that allows your end users to create their own live streams, where these end users have their own streaming software and hardware that you can't control. Because this new functionality adapts based on the live video we receive, rather than just the configuration advertised by the broadcaster, even in cases where your end users' settings are less than ideal, client video players will not receive excessively high estimates of bandwidth requirements, causing playback quality to decrease unnecessarily. Your end users don't have to be OBS Studio experts in order to get high quality video playback.\n\nNo work is required on your end — this change applies to all live inputs, for all customers of Cloudflare Stream. For more, refer to the [docs](/stream/stream-live/#bitrate-estimates-at-each-quality-level-bitrate-ladder)."
        }, 
        {
            "publish_date": "2022-10-05",
            "title": "AV1 Codec support for live streams and recordings (beta)",
            "description": "Cloudflare Stream now supports playback of live videos and live recordings using the [AV1 codec](https://aomedia.org/av1/), which uses 46% less bandwidth than H.264.\n\nFor more, read the [blog post](https://blog.cloudflare.com/av1-cloudflare-stream-beta) or the get started with the [docs](/stream/viewing-videos/av1-playback)."
        }, 
        {
            "publish_date": "2022-09-27",
            "title": "WebRTC live streaming and playback (beta)",
            "description": "Cloudflare Stream now supports live video streaming over WebRTC, with sub-second latency, to unlimited concurrent viewers.\n\nFor more, read the [blog post](https://blog.cloudflare.com/webrtc-whip-whep-cloudflare-stream) or the get started with example code in the [docs](/stream/webrtc-beta)."
        }
    ]
}